app/views/recipes/show.html.erb

      <tbody>
        <% @recipe.foods.each do  |food| %>
---
SELECT "foods".* FROM "foods" INNER JOIN "recipe_foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]