app/views/recipe_foods/new.html.erb

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 68]]
---
<div class = "select_ingredient">
  <%= form.select :food_id, current_user.foods.all.map {|food| [food.name, food.id]} %>