app/controllers/foods_controller.rb

  def create
    @food = Food.new(food_params)
    @food.user = current_user

    if @food.save
---
INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"