app/controllers/shopping_lists_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 3]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 16]]
---
  def index
    @current_user = current_user
    @foods = []
    @total_price = 0
    flag = true
    current_user.recipes.includes([:foods]).each do |recipe|
      recipe.foods.each do |food|
        q = RecipeFood.find_by(food_id: food.id).quantity
        f = current_user.foods.find(food.id)